[{"USER_ID":1, "USER_DESC":"-- Don't worry about what anybody else is going to do. The best way topredict the future is to invent it."},
 {"USER_ID":2, "USER_DESC":"-- Alan KayPremature optimization is the root of all evil (or at least most of it)in programming."},
 {"USER_ID":3, "USER_DESC":"-- Donald KnuthLisp has jokingly been called \"the most intelligent way to misuse acomputer\". I think that description is a great compliment because ittransmits the full flavor of liberation: it has assisted a number of ourmost gifted fellow humans in thinking previously impossible thoughts."},
 {"USER_ID":4, "USER_DESC":"-- Edsger Dijkstra, CACM, 15:10Keep away from people who try to belittle your ambitions. Small peoplealways do that, but the really great make you feel that you, too, canbecome great."},
 {"USER_ID":5, "USER_DESC":"-- Mark TwainWhat Paul does, and does very well, is to take ideas and concepts thatare beautiful in the abstract, and brings them down to a real worldlevel. That's a rare talent to find in writing these days."},
 {"USER_ID":6, "USER_DESC":"-- Jeff \"hemos\" Bates, Director, OSDN; Co-evolver, SlashdotSince programmers create programs out of nothing, imagination is ouronly limitation. Thus, in the world of programming, the hero is the onewho has great vision. Paul Graham is one of our contemporary heroes. Hehas the ability to embrace the vision, and to express it plainly. Hisworks are my favorites, especially the ones describing language design.He explains secrets of programming, languages, and human nature that canonly be learned from the hacker experience. This book shows you hisgreat vision, and tells you the truth about the nature of hacking."},
 {"USER_ID":7, "USER_DESC":"-- Yukihiro \"Matz\" Matsumoto, creator of RubyTo follow the path:    look to the master,    follow the master,    walk with the master,    see through the master,    become the master."},
 {"USER_ID":8, "USER_DESC":"-- Modern zen PoemNo problem should ever have to be solved twice."},
 {"USER_ID":9, "USER_DESC":"-- Eric S. Raymond, How to become a hackerAttitude is no substitute for competence."},
 {"USER_ID":10, "USER_DESC":"-- Eric S. Raymond, How to become a hackerIt is said that the real winner is the one who lives in today but ableto see tomorrow."},
 {"USER_ID":11, "USER_DESC":"-- Juan Meng, Reviewing \"The future of ideas\" by Lawrence LessigFools ignore complexity. Pragmatists suffer it. Some can avoid it.Geniuses remove it."},
 {"USER_ID":12, "USER_DESC":"-- Alan J. Perlis (Epigrams in programming)A year spent in artificial intelligence is enough to make one believe inGod."},
 {"USER_ID":13, "USER_DESC":"-- Alan J. Perlis (Epigrams in programming)Dealing with failure is easy: Work hard to improve. Success is also easyto handle: You've solved the wrong problem. Work hard to improve."},
 {"USER_ID":14, "USER_DESC":"-- Alan J. Perlis (Epigrams in programmi ng)Within a computer natural language is unnatural."},
 {"USER_ID":15, "USER_DESC":"-- Alan J. Perlis (Epigrams in programming)You think you know when you learn, are more sure when you can write,even more when you can teach, but certain when you can program."},
 {"USER_ID":16, "USER_DESC":"-- Alan J. Perlis (Epigrams in programming)Adapting old programs to fit new machines usually means adapting newmachines to behave like old ones."},
 {"USER_ID":17, "USER_DESC":"-- Alan J. Perlis (Epigrams in programming)A little learning is a dangerous thing."},
 {"USER_ID":18, "USER_DESC":"-- Alexander PopeComputer science education cannot make anybody an expert programmer anymore than studying brushes and pigment can make somebody an expertpainter."},
 {"USER_ID":19, "USER_DESC":"-- Eric RaymondEinstein argued that there must be simplified explanations of nature,because God is not capricious or arbitrary."},
 {"USER_ID":20, "USER_DESC":"-- Frederick P. Brooks, No Sliver Bullet.Students should be evaluated on how well they can achieve the goals theystrived to achieve within a realistic context. Students need to learn todo things, not know things."},
 {"USER_ID":21, "USER_DESC":"-- Roger Schank, Engines for EducationWe remember what we learn when we care about performing better and whenwe believe that what we have been asked to do is representative ofreality."},
 {"USER_ID":22, "USER_DESC":"-- Roger Schank, Engines for EducationThere really is no learning without doing."},
 {"USER_ID":23, "USER_DESC":"-- Roger Schank, Engines for EducationWe really have to get over the idea that some stuff is just worthknowing even if you never do anything with it. Human memories happilyerase stuff that has no purpose, so why try to fill up children's headswith such stuff?"},
 {"USER_ID":24, "USER_DESC":"-- Roger Schank, Engines for EducationLa tactique, c'est ce que vous faites quand il y a quelque chose àfaire; la stratégie, c'est ce que vous faites quand il n'y a rien àfaire."},
 {"USER_ID":25, "USER_DESC":"-- Xavier TartacoverThe only problems we can really solve in a satisfactory manner are thosethat finally admit a nicely factored solution."},
 {"USER_ID":26, "USER_DESC":"-- E. W. Dijkstra, The humble programmerThe best way to learn to live with our limitations is to know them."},
 {"USER_ID":27, "USER_DESC":"--E. W. Dijkstra, The humble programmerThis challenge, viz. the confrontation with the programming task, is sounique that this novel experience can teach us a lot about ourselves. Itshould deepen our understanding of the processes of design and creation,it should give us better control over the task of organizing ourthoughts. If it did not do so, to my taste we should no deserve thecomputer at all!  It has allready taught us a few lessons, and the one Ihave chosen to stress in this talk is the following. We shall do a muchbetter programming job, provided that we approach the task with a fullappreciation of its tremenduous difficulty, provided that we stick tomodest and elegant programming languages, provided that we respect theintrinsec limitations of the human mind and approach the task as VeryHumble Programmers."},
 {"USER_ID":28, "USER_DESC":"-- E. W. Dijkstra, The humble programmerCe n'est que par les relations qu'on entretient entre nos différentesconnaissances qu'elles nous restent accessibles."},
 {"USER_ID":29, "USER_DESC":"-- Shnuup, sur l'hypertexte (SELFHTML -> Introduction -> Definitions sur l'hypertexte)We now come to the decisive step of mathematical abstraction: we forgetabout what the symbols stand for. ...[The mathematician] need not beidle; there are many operations which he may carry out with thesesymbols, without ever having to look at the things they stand for."},
 {"USER_ID":30, "USER_DESC":"-- Hermann Weyl, The Mathematical Way of ThinkingAn expert is, according to my working definition \"someone who doesn'tneed to look up answers to easy questions\"."},
 {"USER_ID":31, "USER_DESC":"-- Eric Lippert.The programmer must seek both perfection of part and adequacy ofcollection."},
 {"USER_ID":32, "USER_DESC":"-- Alan J. PerlisThus, programs must be written for people to read, and only incidentallyfor machines to execute."},
 {"USER_ID":33, "USER_DESC":"-- Alan J. PerlisWe control complexity by building abstractions that hide details whenappropriate. We control complexity by establishing conventionalinterfaces that enable us to construct systems by combining standard,well-understood pieces in a ``mix and match'' way. We control complexityby establishing new languages for describing a design, each of whichemphasizes particular aspects of the design and deemphasizes others."},
 {"USER_ID":34, "USER_DESC":"-- Alan J. PerlisThe acts of the mind, wherein it exerts its power over simple ideas, arechiefly these three: 1. Combining several simple ideas into one compoundone, and thus all complex ideas are made. 2. The second is bringing twoideas, whether simple or complex, together, and setting them by oneanother so as to take a view of them at once, without uniting them intoone, by which it gets all its ideas of relations. 3. The third isseparating them from all other ideas that accompany them in their realexistence: this is called abstraction, and thus all its general ideasare made."},
 {"USER_ID":35, "USER_DESC":"-- John Locke, An Essay Concerning Human Understanding (1690)Lisp programmers know the value of everything but the cost of nothing."},
 {"USER_ID":36, "USER_DESC":"-- Alan J. PerlisAn interpreter raises the machine to the level of the user program; acompiler lowers the user program to the level of the machine language."},
 {"USER_ID":37, "USER_DESC":"-- SICPEverything should be made as simple as possible, but no simpler."},
 {"USER_ID":38, "USER_DESC":"-- Albert EinsteinThe great dividing line between success and failure can be expressed infive words: \"I did not have time.\""},
 {"USER_ID":39, "USER_DESC":"-- WestHost weekly newsletter 14 Feb 2003When your enemy is making a very serious mistake, don't be impolite anddisturb him."},
 {"USER_ID":40, "USER_DESC":"-- Napoleon Bonaparte (allegedly)A charlatan makes obscure what is clear; a thinker makes clear what isobscure."},
 {"USER_ID":41, "USER_DESC":"-- Hugh KingsmillThere are two ways of constructing a software design; one way is to makeit so simple that there are obviously no deficiencies, and the other wayis to make it so complicated that there are no obvious deficiencies. Thefirst method is far more difficult."},
 {"USER_ID":42, "USER_DESC":"-- C. A. R. HoareAnd if you go too far up, abstraction-wise, you run out of oxygen.Sometimes smart thinkers just don't know when to stop, and they createthese absurd, all-encompassing, high-level pictures of the universe thatare all good and fine, but don't actually mean anything at all."},
 {"USER_ID":43, "USER_DESC":"-- Joel SpolskyThe three chief virtues of a programmer are: Laziness, Impatience andHubris."},
 {"USER_ID":44, "USER_DESC":"-- Larry Wall (Programming Perl)All non-trivial abstractions, to some degree, are leaky."},
 {"USER_ID":45, "USER_DESC":"-- Joel Spolsky (The Law of Leaky Abstractions)XML wasn't designed to be edited by humans on a regular basis."},
 {"USER_ID":46, "USER_DESC":"-- Guido van RossumPremature abstraction is an equally grevious sin as prematureoptimization."},
 {"USER_ID":47, "USER_DESC":"-- Keith DevensYou can have premature generalization as well as premature optimization."},
 {"USER_ID":48, "USER_DESC":"-- Bjarne StroustrupHe causes his sun to rise on the evil and the good, and sends rain onthe righteous and the unrighteous."},
 {"USER_ID":49, "USER_DESC":"-- Matthew 5:45A language that doesn't affect the way you think about programming, isnot worth knowing."},
 {"USER_ID":50, "USER_DESC":"-- Alan PerlisJe n'ai fait celle-ci plus longue que parce que je n'ai pas eu le loisirde la faire plus courte. (I have made this letter so long only because Idid not have the leisure to make it shorter.)"},
 {"USER_ID":51, "USER_DESC":"-- Blaise Pascal (Lettres Provinciales)Men never do evil so completely and cheerfully as when they do it fromreligious conviction."},
 {"USER_ID":52, "USER_DESC":"-- Blaise Pascal (attributed)Everybody makes their own fun. If you don't make it yourself, it ain'tfun "},
 {"USER_ID":53, "USER_DESC":"-- it's entertainment."},
 {"USER_ID":54, "USER_DESC":"-- David Mamet (as relayed by Joss Whedon)If we wish to count lines of code, we should not regard them as *linesproduced* but as *lines spent*."},
 {"USER_ID":55, "USER_DESC":"-- Edsger DijkstraSometimes a man with too broad a perspective reveals himself as havingno real perspective at all. A man who tries too hard to see every sidemay be a man who is trying to avoid choosing any side. A man who triestoo hard to seek a deeper truth may be trying to hide from the truth healready knows.  That is not a sign of intellectual sophistication and\"\"great thinking\"\". It is a demonstration of moral degeneracy andcowardice."},
 {"USER_ID":56, "USER_DESC":"-- Steven Den BesteOmit needless words."},
 {"USER_ID":57, "USER_DESC":"-- William Strunk, Jr. (The Elements of Style)I have never met a man so ignorant that I couldn't learn something fromhim."},
 {"USER_ID":58, "USER_DESC":"-- Galileo GalileiA society that puts equality "},
 {"USER_ID":59, "USER_DESC":"-- in the sense of equality of outcome "},
 {"USER_ID":60, "USER_DESC":"--ahead of freedom will end up with neither equality nor freedom. The useof force to achieve equality will destroy freedom, and the force,introduced for good purposes, will end up in the hands of people who useit to promote their own interests."},
 {"USER_ID":61, "USER_DESC":"-- Milton Friedman (Thomas Sowell: A Conflict of Visions, p130)Philosophy: the finding of bad reasons for what one believes byinstinct."},
 {"USER_ID":62, "USER_DESC":"-- Brave New World (paraphrased)Of all tyrannies a tyranny sincerely exercised for the good of itsvictims may be the most oppressive. It may be better to live underrobber barons than under omnipotent moral busybodies, The robber baron'scruelty may sometimes sleep, his cupidity may at some point be satiated;but those who torment us for own good will torment us without end, forthey do so with the approval of their own conscience."},
 {"USER_ID":63, "USER_DESC":"-- C.S. LewisFools! Don't they know that tears are a woman's most effective weapon?"},
 {"USER_ID":64, "USER_DESC":"-- Catwoman (The Batman TV Series, episode 83)It's like a condom; I'd rather have it and not need it than need it andnot have it."},
 {"USER_ID":65, "USER_DESC":"-- some chick in Alien vs. Predator, when asked why shealways carries a gunC++ is history repeated as tragedy. Java is history repeated as farce."},
 {"USER_ID":66, "USER_DESC":"-- Scott McKaySimplicity takes effort"},
 {"USER_ID":67, "USER_DESC":"-- genius, even."},
 {"USER_ID":68, "USER_DESC":"-- Paul GrahamShow, don't tell."},
 {"USER_ID":69, "USER_DESC":"-- unknownIn God I trust; I will not be afraid. What can mortal man do to me?"},
 {"USER_ID":70, "USER_DESC":"-- David (Psalm 56:4)Linux is only free if your time has no value."},
 {"USER_ID":71, "USER_DESC":"-- Jamie ZawinskiCode is poetry."},
 {"USER_ID":72, "USER_DESC":"-- wordpress.orgIf you choose not to decide, you still have made a choice."},
 {"USER_ID":73, "USER_DESC":"-- Rush (Freewill)Civilization advances by extending the number of important operationswhich we can perform without thinking about them."},
 {"USER_ID":74, "USER_DESC":"-- Alfred North Whitehead (Introduction to Mathematics)The function of wisdom is to discriminate between good and evil."},
 {"USER_ID":75, "USER_DESC":"-- CiceroThe reason to do animation is caricature. Good caricature picks out theessense of the statement and removes everything else. It's not simplyabout reproducing reality; It's about bumping it up."},
 {"USER_ID":76, "USER_DESC":"-- Brad Bird, writer and director, The IncrediblesMistakes were made."},
 {"USER_ID":77, "USER_DESC":"-- Ronald ReaganI would rather be an optimist and be wrong than a pessimist who provesto be right. The former sometimes wins, but never the latter."},
 {"USER_ID":78, "USER_DESC":"-- \"Hoots\"What is truth?"},
 {"USER_ID":79, "USER_DESC":"-- Pontius PilateLife moves pretty fast. If you don't stop and look around once in awhile, you could miss it."},
 {"USER_ID":80, "USER_DESC":"-- Ferris BuellerLisp is worth learning for the profound enlightenment experience youwill have when you finally get it; that experience will make you abetter programmer for the rest of your days, even if you never actuallyuse Lisp itself a lot."},
 {"USER_ID":81, "USER_DESC":"-- Eric S. RaymondAny sufficiently complicated C or Fortran program contains an ad hoc,informally specified, bug-ridden, slow implementation of half of CommonLisp."},
 {"USER_ID":82, "USER_DESC":"-- Philip Greenspun (Greenspun's Tenth Rule)I was talking recently to a friend who teaches at MIT. His field is hotnow and every year he is inundated by applications from would-begraduate students. \"A lot of them seem smart,\" he said. \"What I can'ttell is whether they have any kind of taste.\""},
 {"USER_ID":83, "USER_DESC":"-- Paul GrahamThe direct pursuit of happiness is a recipe for an unhappy life."},
 {"USER_ID":84, "USER_DESC":"-- Donald CampbellIt's no trick for talented people to be interesting, but it's a gift tobe interested. We want an organization filled with interested people."},
 {"USER_ID":85, "USER_DESC":"-- Randy S. Nelson (dean of Pixar University)Why teach drawing to accountants? Because drawing class doesn't justteach people to draw. It teaches them to be more observant. There's nocompany on earth that wouldn't benefit from having people become moreobservant."},
 {"USER_ID":86, "USER_DESC":"-- Randy S. Nelson (dean of Pixar University)All problems in computer science can be solved by another level ofindirection."},
 {"USER_ID":87, "USER_DESC":"-- Butler LampsonA designer knows he has arrived at perfection not when there is nolonguer anything to add, but when there is no longuer anything to takeaway."},
 {"USER_ID":88, "USER_DESC":"-- Antoine de St Exupery.For the things we have to learn before we can do them, we learn by doingthem."},
 {"USER_ID":89, "USER_DESC":"-- Aristotle.There are many ways to avoid success in life, but the most sure-firejust might be procrastination."},
 {"USER_ID":90, "USER_DESC":"-- Hara Estroff Marano.PI seconds is a nanocentury."},
 {"USER_ID":91, "USER_DESC":"-- [fact]A non negative binary integer value x is a power of 2 iff (x & (x-1)) is0 using 2's complement arithmetic."},
 {"USER_ID":92, "USER_DESC":"-- [fact]While I’ve always appreciated beautiful code, I share Jonathan’s concernabout studying it too much. I think studying beauty in music andpainting has led us to modern classical music and painting that themajority of us just don’t get. Beauty can be seen when it emerges, butisn’t something to strive for in isolation of a larger context. In thesoftware world, the larger context would be the utility of the softwareto the end user."},
 {"USER_ID":93, "USER_DESC":"-- [A comment on a blog]Dont give users the opportunity to lock themselves."},
 {"USER_ID":94, "USER_DESC":"-- unknownAny fool can make the simple complex, only a smart person can make thecomplex simple."},
 {"USER_ID":95, "USER_DESC":"-- unknownTo do something well you have to love it. So to the extent you canpreserve hacking as something you love, you're likely to do it well. Tryto keep the sense of wonder you had about programming at age 14. Ifyou're worried that your current job is rotting your brain, it probablyis."},
 {"USER_ID":96, "USER_DESC":"-- Paul Graham.- If you give him a penny for his thoughts, you'd get change.- Not the sharpest knife in the drawer.- A prime candidate for natural deselection."},
 {"USER_ID":97, "USER_DESC":"-- [Ideas for flamewars]What I didn't understand was that the value of some new acquisitionwasn't the difference between its retail price and what I paid for it.It was the value I derived from it. Stuff is an extremely illiquidasset. Unless you have some plan for selling that valuable thing you gotso cheaply, what difference does it make what it's \"worth?\" The only wayyou're ever going to extract any value from it is to use it. And if youdon't have any immediate use for it, you probably never will."},
 {"USER_ID":98, "USER_DESC":"-- Paul GrahamOnly bad designers blame their failings on the users."},
 {"USER_ID":99, "USER_DESC":"-- unknownHumans aren't rational "},
 {"USER_ID":100, "USER_DESC":"-- they rationalize. And I don't just mean \"someof them\" or \"other people\". I'm talking about everyone. We have a \"logicengine\" in our brains, but for the most part, it's not the one in thedriver's seat "},
 {"USER_ID":101, "USER_DESC":"-- instead it operates after the fact, generatingrationalizations and excuses for our behavior."},
 {"USER_ID":102, "USER_DESC":"-- Paul BuchheitWhat do Americans look for in a car? I've heard many answers when I'veasked this question. The answers include excellent safety ratings, greatgas mileage, handling, and cornering ability, among others. I don'tbelieve any of these. That's because the first principle of the CultureCode is that the only effective way to understand what people truly meanis to ignore what they say. This is not to suggest that peopleintentionally lie or misrepresent themselves. What it means is that,when asked direct questions about their interests and preferences,people tend to give answers they believe the questioner wants to hear.Again, this is not because they intend to mislead. It is because peoplerespond to these questions with their cortexes, the parts of theirbrains that control intelligence rather than emotion or instinct. Theyponder a question, they process a question, and when they deliver ananswer, it is the product of deliberation. They believe they are tellingthe truth. A lie detector would confirm this. In most cases, however,they aren't saying what they mean."},
 {"USER_ID":103, "USER_DESC":"-- The culture code.When all you have is a hammer, everything looks like a nail."},
 {"USER_ID":104, "USER_DESC":"-- unknownGood coders code, great reuse."},
 {"USER_ID":105, "USER_DESC":"-- http://www.catonmat.netThe lesson of the story might appear to be that self-interested andambitious people in power are often the cause of wastefulness indeveloping countries. But self-interested and ambitious people are inpositions of power, great and small, all over the world. In many places,they are restrained by the law, the press, and democratic opposition.Cameroon's tragedy is that there is nothing to hold self-interest incheck."},
 {"USER_ID":106, "USER_DESC":"-- Tim HarfordTo solve your problems you must learn new skills, adapt new thoughtpatterns, and become a different person than you were before thatproblem.  God has crafted you for success. In the middle of everyadversity lie your best opportunities. Discover it, build upon it andmove forward in your journey to live an extraordinary life.  You owe itto yourself to live a great life. Don’t let negative thoughts pull youdown. Be grateful and open to learn and grow."},
 {"USER_ID":107, "USER_DESC":"-- http://secretsofstudying.com/If there is a will, there is a way."},
 {"USER_ID":108, "USER_DESC":"-- unknownHaving large case statements in an object-oriented language is a suresign your design is flawed."},
 {"USER_ID":109, "USER_DESC":"-- [Fixing architecture flaws in Rails' ORM]Being a programmer is the same way. The only way to be a good programmeris to write code. When you realize you haven't been writing much codelately, and it seems like all you do is brag about code you wrote in thepast, and people start looking at you funny while you're shooting yourmouth off, realize it's because they know. They might not even know theyknow, but they know. So, yes, doing what you love brings success, and byall means, throw yourself a nice big party, buy yourself a nice car,soak up the adulation of an adoring crowd. Then shut the fuck up and getback to work."},
 {"USER_ID":110, "USER_DESC":"-- Sincerity TheoryAnother feature about this guy is his low threshold of boredom. He'llpick up on a task and work frantically at it, accomplishing wonders in ashort time and then get bored and drop it before its properly finished.He'll do nothing but strum his guitar and lie around in bed for severaldays after.  Thats also part of the pattern too; periods of freneticactivity followed by periods of melancholia, withdrawal and inactivity.This is a bipolar personality."},
 {"USER_ID":111, "USER_DESC":"-- The bipolar lisp programmerMy dream is that people adopt it on its own merits. We're not trying tobend Ruby on Rails to fit the enterprise, we're encouraging enterprisesto bend to Ruby on Rails. Come if you like it, stay away if you don't.We're not going head over heels to accommodate the enterprise or to lurethem away from Java. That's how you end up with Java, if you startbending to special interest groups."},
 {"USER_ID":112, "USER_DESC":"-- David Heinemeier Hansson (Ruby On Rails' creator)New eyes have X-ray vision.  [someone that hasn't written it is morelikely to spot the bug. \"someone\" can be you after a break]"},
 {"USER_ID":113, "USER_DESC":"-- William S. AnnisSo - what are the most important problems in software engineering? I’danswer “dealing with complexity”."},
 {"USER_ID":114, "USER_DESC":"-- Mark Chu-CarrollSo the mere constraint of staying in regular contact with us will pushyou to make things happen, because otherwise you'll be embarrassed totell us that you haven't done anything new since the last time wetalked."},
 {"USER_ID":115, "USER_DESC":"-- Paul Graham (a talk at Y Combinator, for startup creators).The choice of the university is mostly important for the piece of paperyou get at the end. The education you get depends on you."},
 {"USER_ID":116, "USER_DESC":"-- Andreas ZwinkauRemember that you are humans in the first place and only after thatprogrammers."},
 {"USER_ID":117, "USER_DESC":"-- Alexandru VanceaHumans differ from animals to the degree that they are not merely an endresult of their conditioning, but are able to reflect on theirexperiences and strategies, and apply insight to make changes in the waythey live to modify the outcome."},
 {"USER_ID":118, "USER_DESC":"-- SlideTrombone (comment on \"Programming can ruin your life\")As builders and creators finding the perfect solution should not be ourmain goal. We should find the perfect problem."},
 {"USER_ID":119, "USER_DESC":"-- Isaac (blog comment)Just like carpentry, measure twice cut once."},
 {"USER_ID":120, "USER_DESC":"-- Super-sizing YouTube with Python (Mike Solomon, mike@youtube.com)The good thing about reinventing the wheel is that you get a round one."},
 {"USER_ID":121, "USER_DESC":"-- Douglas Crockford (Author of JSON and JsLint)I feel it is everybodies obligation to reach for the best in themselvesand use that for the interest of mankind."},
 {"USER_ID":122, "USER_DESC":"-- Corneluis (comment on 'Are you going to change the world? (Really?)')Abstraction is a form of data compression: absolutely necessary, becausehuman short-term memory is so small, but the critically important aspectof abstraction is the algorithm that gets you from the name back to the\"uncompressed\" details."},
 {"USER_ID":123, "USER_DESC":"-- Bruce Wilder (blog post comment)Have you ever noticed that when you sit down to write something, halfthe ideas that end up in it are ones you thought of while writing it?The same thing happens with software. Working to implement one ideagives you more ideas."},
 {"USER_ID":124, "USER_DESC":"-- Paul Graham, The other road ahead.In general, we can think of data as defined by some collection ofselectors and constructors, together with specified conditions thatthese procedures must fulfill in order to be a valid representation."},
 {"USER_ID":125, "USER_DESC":"-- SICP, What is meant by data?Resume writing is just like dating, or applying for a bank loan, in thatnobody wants you if you're desperate."},
 {"USER_ID":126, "USER_DESC":"-- Steve Yegge.Mastering isn’t a survival instinct; it’s an urge to excel. Mastering isone of the experiences that delineates us from animals. It is strivingto be more tomorrow than we are today; to perfectly pitch the ball overhome plate; to craft the perfect sentence in an article; to open theoven and feel the warm, richly-scented cloud telling you dinner is goingto be absolutely extraordinary. We humans crave perfection, to bemasters of our domain, to distinguish ourselves by sheer skill andprowess."},
 {"USER_ID":127, "USER_DESC":"-- Joesgoals.comIt(mastering)’s knowing what you are doing."},
 {"USER_ID":128, "USER_DESC":"-- Joesgoals.comWell then. How could you possibly live without automated refactoringtools? How else could you coordinate the caterpillar-like motions of allJava’s identical tiny legs, its thousands of similar parts?I’ll tell you how:Ruby is a butterfly."},
 {"USER_ID":129, "USER_DESC":"-- Stevey, Refactoring Trilogy, Part 1.You will never become a Great Programmer until you acknowledge that youwill always be a Terrible Programmer.You will remain a Great Programmer for only as long as you acknowledgethat you are still a Terrible Programmer."},
 {"USER_ID":130, "USER_DESC":"-- Marc (http://kickin-the-darkness.blogspot.com/)If I tell you I'm good, you would probably think I'm boasting. If I tellyou I'm no good, you know I'm lying."},
 {"USER_ID":131, "USER_DESC":"-- Bruce LeeLet me try to get this straight: Lisp is a language for describingalgorithms. This was JohnMcCarthy's original purpose, anyway: to buildsomething more convenient than a Turing machine. Lisp is not about file,socket or GUI programming - Lisp is about expressive power. (Forexample, you can design multiple object systems for Lisp, in Lisp. Orimplement the now-fashionable AOP. Or do arbitrary transformations onparsed source code.) If you don't value expressive power, Lisp ain't foryou. I, personally, would prefer Lisp to not become mainstream: thiswould necessarily involve a dumbing down."},
 {"USER_ID":132, "USER_DESC":"-- VladimirSlepnevJe ne vous impose aucune contrainte, aucune limite. Surprenez-moi,étonnez-moi, défiez-moi, défiez-vous vous-même. Vous avez le choix: vouspouvez rester dans l'ombre ou en sortir en étant parmis les trop raresexceptions à avoir réussi. L'heure est venue d'aller bien au delà devotre potentiel. L'heure est venue maintenant de descendre vraiment envous. L'heure est venue de démontrer pourquoi vous êtes l'élite, lesquelques élus, les rares lueurs qui offrent à cette compagnie soncaractère exceptionnel, sa luminescence."},
 {"USER_ID":133, "USER_DESC":"-- Le PDG de NURV, dans \"Anti-trust\".If something isn’t working, you need to look back and figure out whatgot you excited in the first place."},
 {"USER_ID":134, "USER_DESC":"-- David Gorman (ImThere.com)Opportunities that present themselves to you are the consequence "},
 {"USER_ID":135, "USER_DESC":"-- atleast partially "},
 {"USER_ID":136, "USER_DESC":"-- of being in the right place at the right time. Theytend to present themselves when you're not expecting it "},
 {"USER_ID":137, "USER_DESC":"-- and oftenwhen you are engaged in other activities that would seem to preclude youfrom pursuing them. And they come and go quickly "},
 {"USER_ID":138, "USER_DESC":"-- if you don't jumpall over an opportunity, someone else generally will and it will vanish."},
 {"USER_ID":139, "USER_DESC":"-- Marc Andreessen (http://blog.pmarca.com/)Pay attention to opportunity cost at all times. Doing one thing meansnot doing other things. This is a form of risk that is very easy toignore, to your detriment."},
 {"USER_ID":140, "USER_DESC":"-- Marc Andreessen (http://blog.pmarca.com/)Seize any opportunity, or anything that looks like opportunity. They arerare, much rarer than you think..."},
 {"USER_ID":141, "USER_DESC":"-- Nassim Nicholas Taleb, \"The Black Swan\".I think that a lot of programmers are ignoring an important point whenpeople talk about reducing code repetition on large projects.Part of the idea is that large projects are intrinsically *wrong*. Thatyou should be looking at making a number of smaller projects that arecomposable, even if you never end up reusing one of those smallerprojects elsewhere."},
 {"USER_ID":142, "USER_DESC":"-- Dan NugentWe tend to seek easy, single-factor explanations of success. For mostimportant things, though, success actually requires avoiding manyseparate causes of failure."},
 {"USER_ID":143, "USER_DESC":"-- Jared DiamondThings which matter most must never be at the mercy of things whichmatter least."},
 {"USER_ID":144, "USER_DESC":"-- Johann Wolfgang Von Goethe (1749-1832)I think the root of your mistake is saying that macros don't scale tolarger groups. The real truth is that macros don't scale to stupidergroups."},
 {"USER_ID":145, "USER_DESC":"-- Paul Graham, on the Lightweight Languages mailing list.Argue with idiots, and you become an idiot.If you compete with slaves you become a slave."},
 {"USER_ID":146, "USER_DESC":"-- Paul Graham and Norbert Weiner, respectivelyAlways dive down into a problem and get your hands on the deepest issuebehind the problem. All other considerations are to dismissed as\"engineering details\"; they can be sorted out after the basic problemhas been solved."},
 {"USER_ID":147, "USER_DESC":"-- Chris CrawfordDon't have good ideas if you aren't willing to be responsible for them."},
 {"USER_ID":148, "USER_DESC":"-- Alan PerlisIt is impossible to sharpen a pencil with a blunt axe. It is equallyvain to try to do it with ten blunt axes instead. "},
 {"USER_ID":149, "USER_DESC":"-- Edsger DijkstraIf we wish to count lines of code, we should not regard them as linesproduced but as lines spent."},
 {"USER_ID":150, "USER_DESC":"-- Edsger DijkstraThe most damaging phrase in the language is, It's always been done thatway."},
 {"USER_ID":151, "USER_DESC":"-- Rear Admiral Grace HopperGetting back to failing early, I've learned it's important to completelyfail. Get fired. Shoot the project, then burn its corpse. Melt the CVSrepository and microwave the backup CDs. When things go wrong, I'veoften tried to play the hero from start to finish. Guess what? Someprojects are doomed no matter what. Some need skills I don't possess.And some need a fresh face."},
 {"USER_ID":152, "USER_DESC":"-- Reginald BraithwaiteThe only thing a man should ever be 100% convinced of is his ownignorance."},
 {"USER_ID":153, "USER_DESC":"-- DJ MacLeanThe best people and organizations have the attitude of wisdom: Thecourage to act on what they know right now and the humility to changecourse when they find better evidence.The quest for management magic and breakthrough ideas is overrated;being a master of the obvious is underrated.Jim Maloney is right: Work is an overrated activity"},
 {"USER_ID":154, "USER_DESC":"-- Bob SuttonIn theory, there’s no difference between theory and practice. But inpractice, there is."},
 {"USER_ID":155, "USER_DESC":"-- Albert EinsteinAct from reason, and failure makes you rethink and study harder.Act from faith, and failure makes you blame someone and push harder."},
 {"USER_ID":156, "USER_DESC":"--  Erik NaggumMeasure everything you can about the product, and you'll start seeingpatterns."},
 {"USER_ID":157, "USER_DESC":"-- Max Levchin, PayPal founder, Talk at StartupSchool2007Something Confusing about \"Hard\":It's tempting to think that if it's hard, then it's valuable.Most valuable things are hard.Most hard things are completely useless "},
 {"USER_ID":158, "USER_DESC":"-- (picture of someone smashingtheir head through concrete blocks kung-fu style).Hard DOES NOT EQUATE TO BEING valuable.Remember Friendster back in the day?You'd sign in, invite friends, have 25 friends, go to their profile, andthen it'd show how you were connected to each one.That's an impressive [some geeky CS jargon] Cone traversal of a tree -100 million string comparisons per page "},
 {"USER_ID":159, "USER_DESC":"-- it won't scale.Used to take a minute per page to load, and Friendster died a painfuldeath.MySpace "},
 {"USER_ID":160, "USER_DESC":"-- not interested in solving problemsThey use the shortcut of \"Miss Fitzpatrick is in your extended network\"(i.e. even when you're not even signed up for MySpace)They didn't solve the hard problem. But they make the more relevantassumption that you want to be connected to hot women. [LOL]Shows Alexa graph showing that in early 2005 Myspace took off, andquickly bypassed Friendster and never looked back."},
 {"USER_ID":161, "USER_DESC":"-- Max Levchin, PayPal founder, Talk at StartupSchool2007Quality of the people is better than the quality of the business idea.Crappy people can screw up the best idea in the world."},
 {"USER_ID":162, "USER_DESC":"-- Hadi Partovi & Ali Partovi (iLike.com), Talk at StartupSchool2007The only constant in the world of hi-tech is change."},
 {"USER_ID":163, "USER_DESC":"-- Mark WardWrite it properly first. It's easier to make a correct program fast,than to make a fast program correct."},
 {"USER_ID":164, "USER_DESC":"-- http://www.cpax.org.uk/prg/J'ai toujours préféré la folie des passions à la sagesse del'indifférence."},
 {"USER_ID":165, "USER_DESC":"-- Anatole FranceYou can’t get to version 500 if you don’t start with a version 1."},
 {"USER_ID":166, "USER_DESC":"-- BetterExplained.comThe wonderful and frustrating thing about understanding yourself is thatnobody can do it for you."},
 {"USER_ID":167, "USER_DESC":"-- BetterExplained.comWhen you have eliminated the impossible, whatever remains, howeverimprobable, must be the truth."},
 {"USER_ID":168, "USER_DESC":"-- Sherlock HolmesIn order to understand what another person is saying, you must assumethat it is true and try to find out what it could be true of."},
 {"USER_ID":169, "USER_DESC":"-- George MillerA journey of a thousand miles must begin with a single step."},
 {"USER_ID":170, "USER_DESC":"-- Lao­TzuC’s great for what it’s great for."},
 {"USER_ID":171, "USER_DESC":"-- Ben Hoyts (micropledge)There is one meaning [for static in C]: a global variable that isinvisible outside the current scope, be it a function or a file."},
 {"USER_ID":172, "USER_DESC":"-- Paolo BonziniProcessors don't get better so that they can have more free time.Processors get better so _you_ can have more free time."},
 {"USER_ID":173, "USER_DESC":"-- LeCamarade (freeshells.ch)The venerable master Qc Na was walking with his student, Anton.  Hoping toprompt the master into a discussion, Anton said \"Master, I have heard thatobjects are a very good thing - is this true?\"  Qc Na looked pityingly athis student and replied, \"Foolish pupil - objects are merely a poor man'sclosures.\"    Chastised, Anton took his leave from his master and returned to his cell,intent on studying closures.  He carefully read the entire \"Lambda: TheUltimate...\" series of papers and its cousins, and implemented a smallScheme interpreter with a closure-based object system.  He learned much, andlooked forward to informing his master of his progress.    On his next walk with Qc Na, Anton attempted to impress his master bysaying \"Master, I have diligently studied the matter, and now understandthat objects are truly a poor man's closures.\"  Qc Na responded by hittingAnton with his stick, saying \"When will you learn? Closures are a poor man'sobject.\"  At that moment, Anton became enlightened."},
 {"USER_ID":174, "USER_DESC":"-- Anton van Straaten (Na = Norman Adams, Qa = Christian Queinnec)Understanding why C++ is the way it is helps a programmer use it well. A deepunderstanding of a tool is essential for an expert craftsman."},
 {"USER_ID":175, "USER_DESC":"-- Bjarne StroustrapNo art, however minor, demands less than total dedication if you want toexcel in it."},
 {"USER_ID":176, "USER_DESC":"-- AlbertiThe minute you put the blame on someone else you’ve switch things frombeing a problem you can control to a problem outside of your control."},
 {"USER_ID":177, "USER_DESC":"-- engtech (internetducttape.com)State is the root of all evil. In particular functions with side effectsshould be avoided."},
 {"USER_ID":178, "USER_DESC":"-- OO Sucks (bluetail.com)Ils ne sont pas forts parce qu'ils sont forts. Ils sont forts parce quenous sommes faibles."},
 {"USER_ID":179, "USER_DESC":"-- Ragala KhalidIt is better to be quiet and thought a fool than to open your mouth andremove all doubt."},
 {"USER_ID":180, "USER_DESC":"-- WikiHowA tail call allows a function to return the result of another functionwithout leaving an entry on the stack. Tail recursion is a specific caseof tail calling."},
 {"USER_ID":181, "USER_DESC":"-- ASPN : Python Cookbook : Explicit Tail CallSimplicity means the achievement of maximum effect with minimum means."},
 {"USER_ID":182, "USER_DESC":"-- Dr. Koichi KawanaNormality is the route to nowhere."},
 {"USER_ID":183, "USER_DESC":"-- Ridderstrale & Nordstorm, Funky BusinessThe problem is that Microsoft just has no taste. And I don't mean thatin a small way, I mean that in a big way."},
 {"USER_ID":184, "USER_DESC":"-- Steve JobsDo you want to sell sugared water all your life or do you want to changethe world?"},
 {"USER_ID":185, "USER_DESC":"-- Steve Jobs, to John Sculley (former Pepsi executive)1 - Creativity and innovation always build on the past.2 - The past always tries to control the creativity that builds on it.3 - Free societies enable the future by limiting the past.4 - Ours is less and less a free society."},
 {"USER_ID":186, "USER_DESC":"-- Lawrence Lessig, Free Culture.Good work is no done by ‘humble’ men."},
 {"USER_ID":187, "USER_DESC":"-- H. Hardy, A mathematician's apology.Simplicity and pragmatism beat complexity and theory any day."},
 {"USER_ID":188, "USER_DESC":"-- Dennis (blog comment)The proof is by reductio ad absurdum, and reductio ad absurdum, whichEuclid loved so much, is one of a mathematician’s finest weapons. It isa far finer gambit than any chess gambit: a chess player may offer thesacrifice of a pawn or even a piece, but a mathematician offers thegame."},
 {"USER_ID":189, "USER_DESC":"-- G. H. HardyRemember, always be yourself ... unless you suck!"},
 {"USER_ID":190, "USER_DESC":"-- Joss WhedonAll great things require great dedication."},
 {"USER_ID":191, "USER_DESC":"-- Chuck Norris(?)I'm always happy to trade performance for readability as long as theformer isn't already scarce."},
 {"USER_ID":192, "USER_DESC":"-- Crayz (Commentor on blog.raganwald.com)You have to write for your audience. I would never write (1..5).map&'*2' in Java when I could writeListFactoryFactory.getListFactoryFromResource(    new ResourceName('com.javax.magnitudes.integers').setLowerBound(1).setUpperBound(5).setStep(1).applyFunctor(    new Functor () { public void eval (x) { return x * 2; } }))I'm simplifying, of course, I've left out the security and loggingwrappers."},
 {"USER_ID":193, "USER_DESC":"-- Reginald BraithwaitThe definition of insanity is doing the same thing over and over againand expecting different results."},
 {"USER_ID":194, "USER_DESC":"-- Benjamin FranklinA no uttered from the deepest conviction is better than a yes merelyuttered to please or what is worse, to avoid trouble."},
 {"USER_ID":195, "USER_DESC":"-- Mahatma GandhiI think it is wise, and only honest, to warn you that my goal isimmodest. It is not my purpose to \"transfer knowledge\" to you that,subsequently, you can forget again. My purpose is no less than toeffectuate in each of you a noticeable, irreversable change. I want youto gain, for the rest of your lives, the insight that beautiful proofsare not \"found\" by trial anf error but are the result of a consciouslyapplied design discipline. I want you to raise your quality standards. Imean, if 10 years from now, when you are doing something quick anddirty, you suddenly visualize that I am looking over your shoulders andsay to yourself \"Dijkstra would not have liked this, well, that wouldbe enough immortality for me."},
 {"USER_ID":196, "USER_DESC":"-- E. W. DijkstraThe general principle for complexity design is this: Think locally, actlocally."},
 {"USER_ID":197, "USER_DESC":"-- Richard P. Gabriel & Ron Goldman, Mob Software: The Erotic Life of CodeProgramming is the art of figuring out what you want so precisely thateven a machine can do it."},
 {"USER_ID":198, "USER_DESC":"-- Some guy who isn't famousHence my urgent advice to all of you to reject the morals of thebestseller society and to find, to start with, your reward in your ownfun. This is quite feasible, for the challenge of simplification is sofascinating that, if we do our job properly, we shall have the greatestfun in the world."},
 {"USER_ID":199, "USER_DESC":"-- E. W. Dijkstra, On the nature of computing science.Remember: you are alone. Every time you can get help from someone,it is an opportunity: you should eagerly size it. But then, promptlyreturn to normal mode: you are alone and you must be prepared to solveevery problem yourself."},
 {"USER_ID":200, "USER_DESC":"-- Eric KEDJIMaking All Software Into Tools Reduces Risk."},
 {"USER_ID":201, "USER_DESC":"-- smoothspan.comSome may say Ruby is a bad rip-off of Lisp or Smalltalk, and I admitthat. But it is nicer to ordinary people."},
 {"USER_ID":202, "USER_DESC":"-- Matz, LL2C and Lisp stand at opposite ends of the spectrum; they're each great atwhat the other one sucks at."},
 {"USER_ID":203, "USER_DESC":"-- Steve Yegge, Tour de Babel.Two people should stay together if together they are better people thanthey would be individually."},
 {"USER_ID":204, "USER_DESC":"-- ?To the optimist, the glass is half full. To the pessimist, the glass ishalf empty. To the engineer, the glass is twice as big as it needs tobe."},
 {"USER_ID":205, "USER_DESC":"-- author unknown (quoted in `Robust Systems', Gerald Jay Suseman)It is practically impossible to teach good programming to students thathave had a prior exposure to BASIC: as potential programmers they arementally mutilated beyond hope of regeneration."},
 {"USER_ID":206, "USER_DESC":"-- Edsger DijkstraWhatever is worth doing at all, is worth doing well."},
 {"USER_ID":207, "USER_DESC":"-- Earl of ChesterfieldRules of Optimization:Rule 1: Don’t do it.Rule 2 (for experts only): Don’t do it yet."},
 {"USER_ID":208, "USER_DESC":"-- M.A. JacksonMore computing sins are committed in the name of efficiency (withoutnecessarily achieving it) than for any other single reason - includingblind stupidity."},
 {"USER_ID":209, "USER_DESC":"-- W.A. WulfWe should forget about small efficiencies, say about 97% of the time:premature optimization is the root of all evil."},
 {"USER_ID":210, "USER_DESC":"-- Donald KnuthThe best is the enemy of the good."},
 {"USER_ID":211, "USER_DESC":"-- VoltaireThe job of a leader today is not to create followers. It’s to createmore leaders."},
 {"USER_ID":212, "USER_DESC":"-- Ralph NaderThe president was visiting NASA headquarters and stopped to talk to aman who was holding a mop. “And what do you do?” he asked. The man, ajanitor, replied, “I’m helping to put a man on the moon, sir.”"},
 {"USER_ID":213, "USER_DESC":"-- The little book of leadershipOnly make new mistakes."},
 {"USER_ID":214, "USER_DESC":"-- Phil DouradoYou can recognize truth by its beauty and simplicity. When you get itright, it is obvious that it is right."},
 {"USER_ID":215, "USER_DESC":"-- Richard FeynmanTalkers are no good doers."},
 {"USER_ID":216, "USER_DESC":"-- William Shakespeare, \"Henry VI\"Photography is painting with light."},
 {"USER_ID":217, "USER_DESC":"-- Eric HamiltonGood artists copy. Great artists steal."},
 {"USER_ID":218, "USER_DESC":"-- Pablo PicassoA guideline in the process of stepwise refinement should be theprinciple to decompose decisions as much as possible, to untangleaspects which are only seemingly interdependent, and to defer thosedecisions which concern details of representation as long as possible."},
 {"USER_ID":219, "USER_DESC":"-- Niklaus WirthVigorous writing is concise. A sentence should contain no unnecessarywords, a paragraph no unnecessary sentences, for the same reason that adrawing should have no unnecessary lines and a machine no unnecessaryparts. This requires not that the writer make all sentences short oravoid all detail and treat subjects only in outline, but that every wordtell."},
 {"USER_ID":220, "USER_DESC":"-- William Strunk, Jr. (The Elements of Style)The problem is that small examples fail to convince, and large examplesare too big to follow."},
 {"USER_ID":221, "USER_DESC":"-- Steve Yegge.We are the sum of our behaviours; excellence therefore is not an act buta habit."},
 {"USER_ID":222, "USER_DESC":"-- Aristotle.The purpose of abstraction is not to be vague, but to create a newsemantic level in which one can be absolutely precise."},
 {"USER_ID":223, "USER_DESC":"-- Edsger DijkstraEvery man prefers belief to the exercise of judgment."},
 {"USER_ID":224, "USER_DESC":"-- SenecaIt’s hard to grasp abstractions if you don’t understand what they’reabstracting away from."},
 {"USER_ID":225, "USER_DESC":"-- Nathan WeizenbaumThat is one of the most distinctive differences between school and thereal world: there is no reward for putting in a good effort. In fact,the whole concept of a \"good effort\" is a fake idea adults invented toencourage kids. It is not found in nature."},
 {"USER_ID":226, "USER_DESC":"-- Paul GrahamI find that the harder I work, the more luck I seem to have."},
 {"USER_ID":227, "USER_DESC":"-- Thomas JeffersonDon't stay in bed, unless you can make money in bed."},
 {"USER_ID":228, "USER_DESC":"-- George BurnsIf everything seems under control, you're not going fast enough."},
 {"USER_ID":229, "USER_DESC":"-- Mario AndrettiChance favors the prepared mind."},
 {"USER_ID":230, "USER_DESC":"-- Louis PasteurControlling complexity is the essence of computer programming."},
 {"USER_ID":231, "USER_DESC":"-- Brian KerniganThe function of good software is to make the complex appear to besimple."},
 {"USER_ID":232, "USER_DESC":"-- Grady BoochProgrammers are in a race with the Universe to create bigger and betteridiot-proof programs, while the Universe is trying to create bigger andbetter idiots.  So far the Universe is winning."},
 {"USER_ID":233, "USER_DESC":"-- Rich CookA hacker on a roll may be able to produce–in a period of a fewmonths–something that a small development group (say, 7-8 people) wouldhave a hard time getting together over a year.  IBM used to report thatcertain programmers might be as much as 100 times as productive as otherworkers, or more."},
 {"USER_ID":234, "USER_DESC":"-- Peter SeebachThe best programmers are not marginally better than merely good ones.They are an order-of-magnitude better, measured by whatever standard:conceptual creativity, speed, ingenuity of design, or problem-solvingability."},
 {"USER_ID":235, "USER_DESC":"-- Randall E. StrossA great lathe operator commands several times the wage of an averagelathe operator, but a great writer of software code is worth 10,000times the price of an average software writer."},
 {"USER_ID":236, "USER_DESC":"-- Bill GatesMeasuring programming progress by lines of code is like measuringaircraft building progress by weight."},
 {"USER_ID":237, "USER_DESC":"-- Bill GatesFirst learn computer science and all the theory.  Next develop aprogramming style.  Then forget all that and just hack."},
 {"USER_ID":238, "USER_DESC":"-- George CarretteTo iterate is human, to recurse divine."},
 {"USER_ID":239, "USER_DESC":"-- L. Peter DeutschThe best thing about a boolean is even if you are wrong, you are onlyoff by a bit."},
 {"USER_ID":240, "USER_DESC":"-- AnonymousShould array indices start at 0 or 1?  My compromise of 0.5 was rejectedwithout, I thought, proper consideration."},
 {"USER_ID":241, "USER_DESC":"-- Stan Kelly-BootleThe use of COBOL cripples the mind; its teaching should therefore beregarded as a criminal offense."},
 {"USER_ID":242, "USER_DESC":"-- E.W. DijkstraIt is practically impossible to teach good programming style to studentsthat have had prior exposure to BASIC.  As potential programmers, theyare mentally mutilated beyond hope of regeneration."},
 {"USER_ID":243, "USER_DESC":"-- E. W. DijkstraOne of the main causes of the fall of the Roman Empire was that–lackingzero–they had no way to indicate successful termination of their Cprograms."},
 {"USER_ID":244, "USER_DESC":"-- Robert FirthSaying that Java is nice because it works on all OSes is like sayingthat anal sex is nice because it works on all genders."},
 {"USER_ID":245, "USER_DESC":"-- AlannaIf Java had true garbage collection, most programs would deletethemselves upon execution."},
 {"USER_ID":246, "USER_DESC":"-- Robert SewellSoftware is like sex: It’s better when it’s free."},
 {"USER_ID":247, "USER_DESC":"-- Linus TorvaldsAny code of your own that you haven’t looked at for six or more monthsmight as well have been written by someone else."},
 {"USER_ID":248, "USER_DESC":"-- Eagleson’s LawGood programmers use their brains, but good guidelines save us having tothink out every case."},
 {"USER_ID":249, "USER_DESC":"-- Francis GlassborowConsidering the current sad state of our computer programs, softwaredevelopment is clearly still a black art, and cannot yet be called anengineering discipline."},
 {"USER_ID":250, "USER_DESC":"-- Bill ClintonIf debugging is the process of removing bugs, then programming must bethe process of putting them in."},
 {"USER_ID":251, "USER_DESC":"-- Edsger W. DijkstraAlways code as if the guy who ends up maintaining your code will be aviolent psychopath who knows where you live."},
 {"USER_ID":252, "USER_DESC":"-- Martin GoldingEverything that can be invented has been invented."},
 {"USER_ID":253, "USER_DESC":"-- Charles H. Duell, Commissioner, U.S. Office of Patents, 1899I think there’s a world market for about 5 computers."},
 {"USER_ID":254, "USER_DESC":"-- Thomas J. Watson, Chairman of the Board, IBM, circa 1948It would appear that we have reached the limits of what it is possibleto achieve with computer technology, although one should be careful withsuch statements, as they tend to sound pretty silly in 5 years. "},
 {"USER_ID":255, "USER_DESC":"-- John Von Neumann, circa 1949But what is it good for?"},
 {"USER_ID":256, "USER_DESC":"-- Engineer at the Advanced Computing Systems Division of IBM,commenting on the microchip, 1968There is no reason for any individual to have a computer in his home."},
 {"USER_ID":257, "USER_DESC":"-- Ken Olson, President, Digital Equipment Corporation, 1977640K ought to be enough for anybody."},
 {"USER_ID":258, "USER_DESC":"-- Bill Gates, 1981Windows NT addresses 2 Gigabytes of RAM, which is more than anyapplication will ever need."},
 {"USER_ID":259, "USER_DESC":"-- Microsoft, on the development of Windows NT, 1992We will never become a truly paper-less society until the Palm Pilotfolks come out with WipeMe 1.0."},
 {"USER_ID":260, "USER_DESC":"-- Andy PiersonIf it keeps up, man will atrophy all his limbs but the push-buttonfinger."},
 {"USER_ID":261, "USER_DESC":"-- Frank Lloyd WrightFunctional programming is like describing your problem to amathematician.  Imperative programming is like giving instructions toan idiot."},
 {"USER_ID":262, "USER_DESC":"-- arcus, #scheme on FreenodeIts a shame that the students of our generation grew up with windows andmice because that tainted our mindset not to think in terms of powerfultools. Some of us are just so tainted that we will never recover."},
 {"USER_ID":263, "USER_DESC":"-- Jeffrey Mark Siskind <qobi@research.nj.nec.com> in comp.lang.lispLisp is a programmable programming language."},
 {"USER_ID":264, "USER_DESC":"-- John FoderaroI guess, when you're drunk, every woman looks beautiful and everylanguage looks (like) a Lisp :)"},
 {"USER_ID":265, "USER_DESC":"-- Lament, #scheme@freenode.netMany of life's failures are people who did not realize how close theywere to success when they gave up."},
 {"USER_ID":266, "USER_DESC":"-- Thomas EdisonYou must always work not just within but below your means. If you canhandle three elements, handle only two. If you can handle ten, thenhandle five. In that way the ones you do handle, you handle with moreease, more mastery and you create a feeling of strength in reserve."},
 {"USER_ID":267, "USER_DESC":"-- Pablo PicassoWhen you’ve got the code all ripped apart, it’s like a car that’s alldisassembled. You’ve got all the parts tying all over your garage andyou have to replace the broken part or the car will never run. It’s notfun until the code gets back to the baseline again."},
 {"USER_ID":268, "USER_DESC":"-- Gary Kildall (inventor of CP/M, one of the first OS for the micro).Well, if you talk about programming to a group of programmers who usethe same language, they can become almost evangelistic about thelanguage. They form a tight-knit community, hold to certain beliefs, andfollow certain rules in their programming. It’s like a church with aprogramming language for a Bible."},
 {"USER_ID":269, "USER_DESC":"-- Gary Kildall (inventor of CP/M, one of the first OS for the micro).It’s a problem if the design doesn’t let you add features at a laterdate. If you have to redo a program, the hours you spend can cause youto lose your competitive edge. A flexible program demonstrates thedifference between a good designer and someone who is just getting apiece of code out."},
 {"USER_ID":270, "USER_DESC":"-- Gary Kildall (inventor of CP/M, one of the first OS for the micro).[How friendly will this machine be?] Well, I don’t think it’s a matterof friendliness, because ultimately if the program is going toaccomplish anything of value, it will probably be relatively complex."},
 {"USER_ID":271, "USER_DESC":"-- Gary Kildall (inventor of CP/M, one of the first OS for the micro).Some people suggest that machines would be friendlier if input could bein a natural language. But natural language is probably the worst kindof input because it can be quite ambiguous. The process of retrievinginformation from the computer would be so time-consuming that you wouldbe better off spending that time getting the information directly froman expert."},
 {"USER_ID":272, "USER_DESC":"-- Gary Kildall (inventor of CP/M, one of the first OS for the micro).The only way of discovering the limits of the possible is to venture alittle way past them into the impossible."},
 {"USER_ID":273, "USER_DESC":"-- Arthur C. ClarkeAny sufficiently advanced technology is undistinguishable from magic."},
 {"USER_ID":274, "USER_DESC":"-- Arthur C. ClarkeThat is the inevitable human response. We’re reluctant to believe thatgreat discoveries are in the air. We want to believe that greatdiscoveries are in our heads—and to each party in the multiple thepresence of the other party is invariably cause for suspicion."},
 {"USER_ID":275, "USER_DESC":"-- Malcolm Gladwell, Who says big ideas are rare? Good ideas are out there for anyone with the wit and the will to findthem."},
 {"USER_ID":276, "USER_DESC":"-- Malcolm Gladwell, Who says big ideas are rare?A person won't become proficient at something until he or she has doneit many times. In other words., if you want someone to be really good atbuilding a software system, he or she will have to have built 10 or moresystems of that type."},
 {"USER_ID":277, "USER_DESC":"-- Philip GreenspunA person won't retain proficiency at a task unless he or she has at onetime learned to perform that task very rapidly. Learning researchdemonstrates that the skills of people who become accurate but not fastdeteriorate much sooner than the skills of people who become bothaccurate and fast."},
 {"USER_ID":278, "USER_DESC":"-- Philip GreenspunTraining research shows that if you get speed now you can get qualitylater. But if you don't get speed you will never get quality in the longrun."},
 {"USER_ID":279, "USER_DESC":"-- Philip GreenspunBeware of bugs in the above code; I have only proved it correct, nottried it."},
 {"USER_ID":280, "USER_DESC":"-- Donald KnuthWear your best for your execution and stand dignified. Your lastrecourse against randomness is how you act — if you can’t controloutcomes, you can control the elegance of your behaviour. You willalways have the last word."},
 {"USER_ID":281, "USER_DESC":"-- Nassim TalebThe human brain starts working the moment you are born and never stopsuntil you stand up to speak in public."},
 {"USER_ID":282, "USER_DESC":"-- AnonymousThe trouble with the world is that the stupid are always cocksure andthe intelligent are always filled with doubt."},
 {"USER_ID":283, "USER_DESC":"-- Bertrand RussellSimple, clear purpose and principles give rise to complex, intelligentbehavior. Complex rules and regulations give rise to simple, stupidbehavior."},
 {"USER_ID":284, "USER_DESC":"-- Dee Hock, Birth of the Chaordic AgeC++ is like teenage sex: Everybody is talking about it all the time,only few are really doing it."},
 {"USER_ID":285, "USER_DESC":"-- unknownFunctional programming is to algorithms as the ubiquitous little blackdress is to women's fashion."},
 {"USER_ID":286, "USER_DESC":"-- Mark Tarver (of \"The bipolar Lisp programmer\" fame)Java and C++ make you think that the new ideas are like the old ones.Java is the most distressing thing to hit computing since MS-DOS."},
 {"USER_ID":287, "USER_DESC":"-- Alan KayFor complex systems, the compiler and development environment need to bein the same language that its supporting. It's the only way to growcode."},
 {"USER_ID":288, "USER_DESC":"-- Alan KaySimple things should be simple. Complex things should be possible."},
 {"USER_ID":289, "USER_DESC":"-- Alan KayI invented the term Object-Oriented, and I can tell you I did not haveC++ in mind."},
 {"USER_ID":290, "USER_DESC":"-- Alan KayAll creativity is an extended form of a joke."},
 {"USER_ID":291, "USER_DESC":"-- Alan KayIf you don't fail at least 90 percent of the time, you're not aiminghigh enough."},
 {"USER_ID":292, "USER_DESC":"-- Alan KayRevolutions come from standing on the shoulders of giants and facing ina better direction."},
 {"USER_ID":293, "USER_DESC":"-- Alan KayCe n’est que par les beaux sentiments qu’on parvient à la fortune !"},
 {"USER_ID":294, "USER_DESC":"-- Charles Baudelaire, Conseils aux jeunes littérateurs.La haine est une liqueur précieuse, un poison plus cher que celui desBorgia, - car il est fait avec notre sang, notre santé, notre sommeil,et les deux tiers de notre amour! Il faut en être avare!"},
 {"USER_ID":295, "USER_DESC":"-- Charles Baudelaire, Conseils aux jeunes littérateurs.L’art qui satisfait le besoin le plus impérieux sera toujours le plushonoré."},
 {"USER_ID":296, "USER_DESC":"-- Charles Baudelaire, Conseils aux jeunes littérateurs.If it looks like a duck, walks like a duck, and quacks like a duck, it'sa duck."},
 {"USER_ID":297, "USER_DESC":"-- Official definition of \"duck typing\"In OO, it's the data that is the \"important\" thing: you define the classwhich contains member data, and only incidentally contains code formanipulating the object. In FP, it's the code that's important: youdefine a function which contains code for working with the data, andonly incidentally define what the data is."},
 {"USER_ID":298, "USER_DESC":"-- almkgor, on redditDes mots simples, quand ils sont bien utilisés, font faire à des gensordinaires des choses extraordinaires."},
 {"USER_ID":299, "USER_DESC":"-- Khaled TANGAOIt was Edison who said ‘1% inspiration, 99% perspiration’. That may havebeen true a hundred years ago. These days it's ‘0.01% inspiration,99.99% perspiration’, and the inspiration is the easy part."},
 {"USER_ID":300, "USER_DESC":"-- Linux TorvaldsThe greatest challenge to any thinker is stating the problem in a waythat will allow a solution."},
 {"USER_ID":301, "USER_DESC":"-- Bertrand RussellNo matter how much you plan you’re likely to get half wrong anyway. Sodon’t do the ‘paralysis through analysis’ thing. That only slowsprogress and saps morale."},
 {"USER_ID":302, "USER_DESC":"-- 37 Signal, Getting real[Innovation] comes from saying no to 1,000 things to make sure we don’tget on the wrong track or try to do too much. We’re always thinkingabout new markets we could enter, but it’s only by saying no that youcan concentrate on the things that are really important."},
 {"USER_ID":303, "USER_DESC":"-- Steve JobsThe ability to simplify means to eliminate the unnecessary so that thenecessary may speak."},
 {"USER_ID":304, "USER_DESC":"-- Hans HofmannHowever beautiful the strategy, you should occasionally look at theresults."},
 {"USER_ID":305, "USER_DESC":"-- Winston ChurchillGenius is 1% inspiration and 99% perspiration."},
 {"USER_ID":306, "USER_DESC":"-- Thomas EdisonI’d rather write programs to write programs than write programs."},
 {"USER_ID":307, "USER_DESC":"-- Richard SitesHeureux l'étudiant qui comme la Rivière peut suivre son cours sansquitter son lit..."},
 {"USER_ID":308, "USER_DESC":"-- Sebastien, sur commentcamarche.netSide projects are less masturbatory than reading RSS, often moreuseful than MobileMe, more educational than the comments on Reddit,and usually more fun than listening to keynotes."},
 {"USER_ID":309, "USER_DESC":"-- Chris Wanstrath:nunmap can also be used outside of a monastery."},
 {"USER_ID":310, "USER_DESC":"-- Vim user manualI had to learn how to teach less, so that more could be learned."},
 {"USER_ID":311, "USER_DESC":"-- Tim Gallwey, The inner game of workWorkers of the world, the chains that bind you are not held in place bya ruling class, a \"superior\" race, by society, the state, or a leader.They are held in place by none other than yourself. Those who seek toexploit are not themselves free, for they place no value in freedom. Whois it that really employs you and commands you to pick up your dailyload? And who is it that you allow to pass judgment on the adequacy ofyour toil? Who have you empowered to dangle the carrot before you andthreaten with disapproval? Who, when you wake each morning, sends youoff to what you call your work?Is there an \"I want to\" behind all your \"I have to,\" or have you been solong forgotten to yourself that \"I want\" exists only as an idea in yourhead? If you have disconnected from your soul's desire and are drowningin an ocean of \"have to,\" then rise up and overthrow your master. Beginthe journey toward emancipation.  Work only in such a way that you aretruly self-employed."},
 {"USER_ID":312, "USER_DESC":"-- Tim Gallwey, The inner game of workThe Work Begins Anew, The Hope Rises Again, And The Dream Lives On."},
 {"USER_ID":313, "USER_DESC":"-- Ted KennedyThe hardest part of design ... is keeping features out."},
 {"USER_ID":314, "USER_DESC":"-- Donald Norman Before software can be reusable it first has to be usable."},
 {"USER_ID":315, "USER_DESC":"-- Ralph Johnson The opposite of love is not hate, it is indifference."},
 {"USER_ID":316, "USER_DESC":"-- Elie Wiesel- Gbi de fer- Howa!- On va en France- Non, je vais pas!- Pourquoi?- Parce ki y a pas agouti là-bas!"},
 {"USER_ID":317, "USER_DESC":"-- Gbi de ferEcoute, crois en ton projet... Implique toi à fond... Trouve des aspectsinnovants pour te distinguer des autres. Tu verras que tu te ferasremarquer très facilement..."},
 {"USER_ID":318, "USER_DESC":"-- Khaled TangaoPerpetual optimism is a force multiplier."},
 {"USER_ID":319, "USER_DESC":"-- Colin PowellBe the change you want to see in the world."},
 {"USER_ID":320, "USER_DESC":"-- Mahatma GandhiThe art of getting someone else to do something you want done because hewants to do it [Leadership]."},
 {"USER_ID":321, "USER_DESC":"-- Dwight D. Enseinhover.No one is all evil. Everybody has a good side. If you keep waiting, itwill comme up."},
 {"USER_ID":322, "USER_DESC":"-- Randy PauschExperience is what you get when you don't get what you want."},
 {"USER_ID":323, "USER_DESC":"-- Cited by Randy PauschLuck is where preparation meets opportunity."},
 {"USER_ID":324, "USER_DESC":"-- Randy PauschBonne bosse et reste le boss."},
 {"USER_ID":325, "USER_DESC":"-- Darryl AmedonThe greatest of all weaknesses is the fear of appearing weak."},
 {"USER_ID":326, "USER_DESC":"-- J. B. Bossuet, Politics from Holy Writ, 1709It's easier to ask forgiveness than it is to get permission."},
 {"USER_ID":327, "USER_DESC":"-- Rear Admiral Dr. Grace HopperAn investment in knowledge always pays the best interest."},
 {"USER_ID":328, "USER_DESC":"-- Benjamin FranklinNatives who beat drums to drive off evil spirits are objects of scorn tosmart Americans who blow horns to break up traffic jams."},
 {"USER_ID":329, "USER_DESC":"-- Mary Ellen KellyA CS professor once explained recursion as follows:A child couldn't sleep, so her mother told her a story about a little frog,    who couldn't sleep, so the frog's mother told her a story about a little bear,         who couldn't sleep, so the bear's mother told her a story about a little weasel...            who fell asleep.        ...and the little bear fell asleep;    ...and the little frog fell asleep;...and the child fell asleep."},
 {"USER_ID":330, "USER_DESC":"-- everything2.comNever do the impossible. People will expect you to do it forever after."},
 {"USER_ID":331, "USER_DESC":"-- pigsandfishes.comHire people smarter than you.  Work with people smarter than you.Listen to them. Let them lead you. Take the blame for all failures,give away the credit for all successes."},
 {"USER_ID":332, "USER_DESC":"-- How to fail: 25 secrets learned through failureGive up control. You never really had it anyway."},
 {"USER_ID":333, "USER_DESC":"-- How to fail: 25 secrets learned through failureNe te mets pas de limite, la vie se chargera de la mettre a ta place."},
 {"USER_ID":334, "USER_DESC":"-- Darryl AMEDONOnly two things are infinite, the universe and human stupidity. And I'm not sosure about the former."},
 {"USER_ID":335, "USER_DESC":"-- Albert EinsteinThe important thing is not to stop questioning."},
 {"USER_ID":336, "USER_DESC":"-- Albert EinsteinDo not accept anything because it comes from the mouth of a respected person."},
 {"USER_ID":337, "USER_DESC":"-- BuddhaWork as intensely as you play and play as intensely as you work."},
 {"USER_ID":338, "USER_DESC":"-- Eric S. Raymond, How To Be A HackerA witty saying proves nothing"},
 {"USER_ID":339, "USER_DESC":"-- VoltaireSound methodology can empower and liberate the creative mind; it cannot inflameor inspire the drudge."},
 {"USER_ID":340, "USER_DESC":"-- Frederick P. Brooks, No Sliver Bullet.La connaissance d'un défaut ne l'enlève pas, elle nous torture jusqu'à sacorrection."},
 {"USER_ID":341, "USER_DESC":"-- Daniel Lovewin (Guillaume Kpotufe)Je crois au flooding."},
 {"USER_ID":342, "USER_DESC":"-- Karim BAINA (en parlant du dailogue avec les administrations)Il y a très loin de la velléité à la volnt, de la volonté à la résolution, de larésolution au choix des moyens, du choix ds moyens à lapplication."},
 {"USER_ID":343, "USER_DESC":"-- Jean-François Paul de Gondi de RetzDo not spoil what you have by desiring what you have not; but remember that whatyou now have was once among the things only hoped for."},
 {"USER_ID":344, "USER_DESC":"-- Greek philosopher EpicurusNobody can make you feel inferior without your consent."},
 {"USER_ID":345, "USER_DESC":"-- Eleanor RooseveltIf you tell the truth, you don't have to remember anything."},
 {"USER_ID":346, "USER_DESC":"-- Mark TwainYou know you're in love when you can't fall asleep because reality is finallybetter than your dreams."},
 {"USER_ID":347, "USER_DESC":"-- Dr. SeussThe opposite of love is not hate, it's indifference."},
 {"USER_ID":348, "USER_DESC":"-- Elie WieselLife is what happens to you while you're busy making other plans."},
 {"USER_ID":349, "USER_DESC":"-- John LennonWhenever you find yourself on the side of the majority, it is time to pause andreflect."},
 {"USER_ID":350, "USER_DESC":"-- Mark TwainTo be yourself in a world that is constantly trying to make you something elseis the greatest accomplishment."},
 {"USER_ID":351, "USER_DESC":"-- Ralph Waldo EmersonIt is not a lack of love, but a lack of friendship that makes unhappy marriages."},
 {"USER_ID":352, "USER_DESC":"-- Friedrich NietzscheIn terms of energy, it's better to make a wrong choice than none at all."},
 {"USER_ID":353, "USER_DESC":"-- George Leonard, Mastery.Courage is grace under pressure."},
 {"USER_ID":354, "USER_DESC":"-- Ernest HemingwayActually, the essence of boredom is to be found in the obsessive search fornovelty. Satisfaction lies in mindful repetition, the discovery of endlessrichness in subtle variations on familiar themes."},
 {"USER_ID":355, "USER_DESC":"-- George Leonard, Mastery.Before enlightenment, chop wood and carry water.After enlightenment, chop wood and carry water."},
 {"USER_ID":356, "USER_DESC":"-- Ancient Eastern adageAcknowledging the negative doesn't mean sniveling [whining, complaining]; itmeans facing the truth and then moving on."},
 {"USER_ID":357, "USER_DESC":"-- George Leonard, Mastery.Whatever you can do, or dream you can, begin it. Boldness has genius, power, andmagic in it."},
 {"USER_ID":358, "USER_DESC":"-- GoetheWhat we choose to fight is so tiny!What fights us is so great!...When we win it's with small things,and the triumph itself makes us small....Winning does not tempt that man.This is how he grows: by being defeated, decisively,by constantly greater beings. "},
 {"USER_ID":359, "USER_DESC":"-- Rainer Maria Rilke, The Man Watching.We fail to realize that mastery is not about perfection. It's about a process,a journey. The master is the one who stays on the path day after day, year afteryear. The master is the one who is willing to try, and fail, and try again, foras long as he or she lives."},
 {"USER_ID":360, "USER_DESC":"-- George Leonard, Mastery.Are you willing to wear your white belt?"},
 {"USER_ID":361, "USER_DESC":"-- George Leonard, Mastery."}]